go-profiling-toolchain/e5-pyroscope-overhead/output/agent-hey.log

Summary:
  Total:	60.0007 secs
  Slowest:	0.0067 secs
  Fastest:	0.0001 secs
  Average:	0.0018 secs
  Requests/sec:	44656.6436
  
  Total data:	8038296 bytes
  Size/request:	8 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [945071]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [53967]	|■■
  0.002 [553]	|
  0.003 [378]	|
  0.003 [0]	|
  0.004 [0]	|
  0.005 [0]	|
  0.005 [3]	|
  0.006 [14]	|
  0.007 [13]	|


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0006 secs
  50%% in 0.0007 secs
  75%% in 0.0007 secs
  90%% in 0.0007 secs
  95%% in 0.0008 secs
  99%% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0039 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0014 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:	0.0018 secs, 0.0001 secs, 0.0028 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	1000000 responses