go-profiling-toolchain/e5-pyroscope-overhead/output/baseline-hey.log

Summary:
  Total:	60.0008 secs
  Slowest:	0.0076 secs
  Fastest:	0.0001 secs
  Average:	0.0018 secs
  Requests/sec:	45387.6598
  
  Total data:	8169888 bytes
  Size/request:	8 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [988831]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [10481]	|
  0.002 [503]	|
  0.003 [133]	|
  0.004 [21]	|
  0.005 [0]	|
  0.005 [0]	|
  0.006 [4]	|
  0.007 [14]	|
  0.008 [12]	|


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0006 secs
  50%% in 0.0007 secs
  75%% in 0.0007 secs
  90%% in 0.0007 secs
  95%% in 0.0007 secs
  99%% in 0.0009 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0042 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:	0.0018 secs, 0.0001 secs, 0.0037 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0027 secs

Status code distribution:
  [200]	1000000 responses